{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_9","layers":[{"class_name":"Dense","config":{"units":222,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense35","trainable":true,"batch_input_shape":[null,222],"dtype":"float32"}},{"class_name":"Dense","config":{"units":50,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense36","trainable":true}},{"class_name":"Dense","config":{"units":50,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense37","trainable":true}},{"class_name":"Dense","config":{"units":50,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense38","trainable":true}},{"class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense39","trainable":true}}]},"keras_version":"tfjs-layers 3.8.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense35/kernel","shape":[222,222],"dtype":"float32"},{"name":"dense_Dense35/bias","shape":[222],"dtype":"float32"},{"name":"dense_Dense36/kernel","shape":[222,50],"dtype":"float32"},{"name":"dense_Dense36/bias","shape":[50],"dtype":"float32"},{"name":"dense_Dense37/kernel","shape":[50,50],"dtype":"float32"},{"name":"dense_Dense37/bias","shape":[50],"dtype":"float32"},{"name":"dense_Dense38/kernel","shape":[50,50],"dtype":"float32"},{"name":"dense_Dense38/bias","shape":[50],"dtype":"float32"},{"name":"dense_Dense39/kernel","shape":[50,1],"dtype":"float32"},{"name":"dense_Dense39/bias","shape":[1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.8.0","convertedBy":null}